In [1]:
import pandas as pd

In [2]:
import atoti as tt

Welcome to atoti 0.7.1!

By using this community edition, you agree with the license available at https://docs.atoti.io/latest/eula.html.
Browse the official documentation at https://docs.atoti.io.
Join the community at https://www.atoti.io/register.

atoti collects telemetry data, which is used to help understand how to improve the product.
If you don't wish to send usage data, set the ATOTI_DISABLE_TELEMETRY environment variable to True.

You can hide this message by setting the ATOTI_HIDE_EULA_MESSAGE environment variable to True.

### Load Data

In [3]:
courses_frame = pd.read_csv('data/courses.csv')

In [4]:
std_info_frame = pd.read_csv('data/studentInfo.csv')

In [5]:
assesments_frame = pd.read_csv('data/assessments.csv')

### Ambil fitur-fitur pada tabel yang akan untuk dianalisis

#### Pilih fitur dari Tabel course

In [6]:
# ambil feature yang diperlukan pada dataframe std_asses_frame
courses = pd.DataFrame(courses_frame, columns=['code_presentation', 'code_module', 'module_presentation_length'])

# tampilkan data
courses.head(5)

  code_presentation code_module  module_presentation_length
0             2013J         AAA                         268
1             2014J         AAA                         269
2             2013J         BBB                         268
3             2014J         BBB                         262
4             2013B         BBB                         240

#### Pilih fitur dari Tabel studentInfo

In [7]:
# ambil feature yang diperlukan pada dataframe std_asses_frame
stdInfo = pd.DataFrame(std_info_frame, columns=['id_student', 'final_result', 'gender','imd_band',
                                                'highest_education', 'age_band', 'num_of_prev_attempts',
                                                'studied_credits', 'region'])

# id perlu diubah menjadi string
stdInfo['id_student'] = stdInfo['id_student'].astype('string')

# tampilkan data
stdInfo.head(5)

,id_student,final_result,gender,imd_band,highest_education,age_band,num_of_prev_attempts,studied_credits,region
0,11391,Pass,M,90-100%,HE Qualification,55<=,0,240,East Anglian Region
1,28400,Pass,F,20-30%,HE Qualification,35-55,0,60,Scotland
2,30268,Withdrawn,F,30-40%,A Level or Equivalent,35-55,0,60,North Western Region
3,31604,Pass,F,50-60%,A Level or Equivalent,35-55,0,60,South East Region
4,32885,Pass,F,50-60%,Lower Than A Level,0-35,0,60,West Midlands Region

#### Pilih fitur dari Tabel assesments

In [8]:
# ambil feature yang diperlukan pada dataframe assesments_frame
asses = pd.DataFrame(assesments_frame, columns=['id_assessment', 'assessment_type', 'date'])

# id perlu diubah menjadi string
asses['id_assessment'] = asses['id_assessment'].astype('string')

asses.head(5)

  id_assessment assessment_type   date
0          1752             TMA   19.0
1          1753             TMA   54.0
2          1754             TMA  117.0
3          1755             TMA  166.0
4          1756             TMA  215.0

### Handling Null Values

#### Null values pada tabel course

In [9]:
pd.DataFrame(courses.isnull().sum().sort_values(ascending=False)).head()

                            0
code_presentation           0
code_module                 0
module_presentation_length  0

tidak ditemukan null values --> aman

#### Null values pada tabel studentInfo

In [10]:
pd.DataFrame(stdInfo.isnull().sum().sort_values(ascending=False)).head()

                      0
imd_band           1111
id_student            0
final_result          0
gender                0
highest_education     0

imd_band akan didrop karena tidak digunakan dalam analisis

In [11]:
stdInfo = stdInfo.drop(['imd_band'], axis=1)

In [12]:
pd.DataFrame(stdInfo.isnull().sum().sort_values(ascending=False)).head()

                   0
id_student         0
final_result       0
gender             0
highest_education  0
age_band           0

#### Null values pada tabel assesments

In [13]:
pd.DataFrame(asses.isnull().sum().sort_values(ascending=False)).head()

                  0
date             11
id_assessment     0
assessment_type   0

date akan didrop karena tidak digunakan dalam analisis

In [14]:
asses = asses.drop(['date'], axis=1)

In [15]:
pd.DataFrame(asses.isnull().sum().sort_values(ascending=False)).head()

                 0
id_assessment    0
assessment_type  0